In [1]:
 import pandas as pd

In [2]:
data=[['Alice',25,5000],['BOB',27,9000],['RYAN',26,6000]]

In [3]:
df=pd.DataFrame(data,columns=['Name','age','salary'])

In [4]:
df

    Name  age  salary
0  Alice   25    5000
1    BOB   27    9000
2   RYAN   26    6000

In [5]:
df.iloc[0]

Name      Alice
age          25
salary     5000
Name: 0, dtype: object

In [6]:
df.loc[0]

Name      Alice
age          25
salary     5000
Name: 0, dtype: object

In [7]:
df

    Name  age  salary
0  Alice   25    5000
1    BOB   27    9000
2   RYAN   26    6000

In [8]:
df.head

<bound method NDFrame.head of     Name  age  salary
0  Alice   25    5000
1    BOB   27    9000
2   RYAN   26    6000>

In [9]:
df.tail(2)

   Name  age  salary
1   BOB   27    9000
2  RYAN   26    6000

In [10]:
df[['Name','age']]

    Name  age
0  Alice   25
1    BOB   27
2   RYAN   26

In [11]:
df

    Name  age  salary
0  Alice   25    5000
1    BOB   27    9000
2   RYAN   26    6000

In [12]:
df['expense']=df['salary']*0.5

In [13]:
df

    Name  age  salary  expense
0  Alice   25    5000   2500.0
1    BOB   27    9000   4500.0
2   RYAN   26    6000   3000.0

In [14]:
df.drop(columns=['expense'],inplace=True)

In [15]:
df

    Name  age  salary
0  Alice   25    5000
1    BOB   27    9000
2   RYAN   26    6000

In [16]:
df.iloc[1,2]

9000

In [18]:
df.loc[1,'age']

27

In [19]:
df.iloc[1,1]

27

In [20]:
df

    Name  age  salary
0  Alice   25    5000
1    BOB   27    9000
2   RYAN   26    6000

In [21]:
df.loc[[1,2],['age','salary']]

   age  salary
1   27    9000
2   26    6000

In [22]:
df.iloc[[1,2],[1,2]]

   age  salary
1   27    9000
2   26    6000

In [23]:
df.loc[0:2,'age':'salary']

   age  salary
0   25    5000
1   27    9000
2   26    6000

In [24]:
df.iloc[0:2,1:3]

   age  salary
0   25    5000
1   27    9000

In [25]:
df

    Name  age  salary
0  Alice   25    5000
1    BOB   27    9000
2   RYAN   26    6000

In [26]:
df.iloc[0:3,2]

0    5000
1    9000
2    6000
Name: salary, dtype: int64

In [27]:
df

    Name  age  salary
0  Alice   25    5000
1    BOB   27    9000
2   RYAN   26    6000

In [28]:
df.iloc[:,2]

0    5000
1    9000
2    6000
Name: salary, dtype: int64

In [29]:
df.iloc[0:2]

    Name  age  salary
0  Alice   25    5000
1    BOB   27    9000

In [30]:
df['expense']=[2500,500,600]

In [31]:
df

    Name  age  salary  expense
0  Alice   25    5000     2500
1    BOB   27    9000      500
2   RYAN   26    6000      600

In [32]:
df.loc[1]=['Robert',32,5000,600]

In [33]:
df

     Name  age  salary  expense
0   Alice   25    5000     2500
1  Robert   32    5000      600
2    RYAN   26    6000      600

In [34]:
df.iloc[2]=['AMAN',20,5000,600]

In [35]:
df

     Name  age  salary  expense
0   Alice   25    5000     2500
1  Robert   32    5000      600
2    AMAN   20    5000      600

In [37]:
df.loc[3]=['AMAN',32,5000,600]

In [38]:
df

     Name  age  salary  expense
0   Alice   25    5000     2500
1  Robert   32    5000      600
2    AMAN   20    5000      600
3    AMAN   32    5000      600

In [39]:
df.iloc[2,1]=[25]

In [40]:
df

     Name  age  salary  expense
0   Alice   25    5000     2500
1  Robert   32    5000      600
2    AMAN   25    5000      600
3    AMAN   32    5000      600

In [41]:
df.loc[df['expense']<700,'expense']=1300

In [42]:
df

     Name  age  salary  expense
0   Alice   25    5000     2500
1  Robert   32    5000     1300
2    AMAN   25    5000     1300
3    AMAN   32    5000     1300

In [43]:
df.iloc[2,0]='AMAN'

In [44]:
df

     Name  age  salary  expense
0   Alice   25    5000     2500
1  Robert   32    5000     1300
2    AMAN   25    5000     1300
3    AMAN   32    5000     1300

In [ ]:
df.loc[df['age']<=25,